doc/org-mode/actions/base.org

#+TITLE: Base Action Element
#+STYLE: <LINK href='../stylesheet.css' rel='stylesheet' type='text/css' />
#+AUTHOR: Rusty Klophaus (@rklophaus)
#+OPTIONS:   H:2 num:1 toc:1 \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+EMAIL: 
#+TEXT: [[file:../index.org][Getting Started]] | [[file:../api.org][API]] | [[file:../elements.org][Elements]] | Actions | [[file:../validators.org][Validators]] | [[file:../handlers.org][Handlers]] | [[file:../about.org][About]]

* Base Action

  In object-oriented parlance, all Nitrogen actions are subclasses
  of the base actions. This means that all Nitrogen elements can
  use the attributes listed below.

** Attributes

   + module - (/atom/) :: The module containing the logic for this action. Set automatically.

   + trigger - (/atom/) :: The id of the Nitrogen element that will trigger this action. Set automatically.

   + target - (/atom/) :: The id of the Nitrogen element to be referenced by obj('me'). Set automatically.

   + actions - (/list af actions/) :: A list of actions grouped within this action.

   + show\_if - (/boolean/) :: If set to true, this action will be rendered. Otherwise, it will not.
