doc/html/actions/base.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Base Action Element</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-11-22 10:50:15 EST"/>
<meta name="author" content="Rusty Klophaus (@rklophaus)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<LINK href='../stylesheet.css' rel='stylesheet' type='text/css' />
</head>
<body>
<div id="content">

<h1 class="title">Base Action Element</h1>

<p><a href="../index.html">Getting Started</a> | <a href="../api.html">API</a> | <a href="../elements.html">Elements</a> | Actions | <a href="../validators.html">Validators</a> | <a href="../handlers.html">Handlers</a> | <a href="../about.html">About</a>
</p>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Base Action </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Base Action </h2>
<div class="outline-text-2" id="text-1">


<p>
In object-oriented parlance, all Nitrogen actions are subclasses
of the base actions. This means that all Nitrogen elements can
use the attributes listed below.
</p>

</div>

<div id="outline-container-1_1" class="outline-3">
<h3 id="sec-1_1"><span class="section-number-3">1.1</span> Attributes </h3>
<div class="outline-text-3" id="text-1_1">


<dl>
<dt>module - (<i>atom</i>)</dt><dd>
The module containing the logic for this action. Set automatically.

</dd>
<dt>trigger - (<i>atom</i>)</dt><dd>
The id of the Nitrogen element that will trigger this action. Set automatically.

</dd>
<dt>target - (<i>atom</i>)</dt><dd>
The id of the Nitrogen element to be referenced by obj('me'). Set automatically.

</dd>
<dt>actions - (<i>list af actions</i>)</dt><dd>
A list of actions grouped within this action.

</dd>
<dt>show_if - (<i>boolean</i>)</dt><dd>
If set to true, this action will be rendered. Otherwise, it will not.
</dd>
</dl>
</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Rusty Klophaus (@rklophaus)
</p>
<p class="date"> Date: 2010-11-22 10:50:15 EST</p>
<p class="creator">HTML generated by org-mode 7.01h in emacs 24</p>
</div>
</div>
</body>
</html>
